[
  {
    "id": "HOP1",
    "name": "UCHENNA CHUKWUEKE",
    "title": "Group Managing Director/Chief Executive Officer ​",
    "image": "assets/leadership-images/uchenna.jpg",
    "description": "Uchenna Azubuike Chukwueke is the Group Managing Director and Chief Executive Officer. \n He holds a B.Sc in Sociology and an MBA in Business Administration. He has developed requisite proficiencies in Business Development, Strategic Business Management, Project Planning and Project Management. \n Prior to joining the Management Team at Avvic Group, he had worked with Zenith Bank Plc for over fifteen years in different business development capacities. He also worked with VFD Group, a finance and digital banking firm, as Regional Head South East. \n Uchenna Chukwueke brings his focused and result-oriented experience to the Board."
  },
  {
    "id": "HOP2",
    "name": "OBIOMA AKPAGBULA",
    "title": "Executive Director ​",
    "image": "assets/leadership-images/obioma.jpg",
    "description": "Obioma Akpagbula is the Group Executive Director, Finance and Strategy. \n He brings to the Group, core competencies in investment and portfolio management, risk management, banking operations, corporate financial management, financial analysis and business development. \n His experience in the financial sector spans over seventeen years during which he worked with Zenith Bank Plc in different capacities. \n Obioma Akpagbula holds a B.Sc. and M.Sc. in Economics. He is an Associate of the Chartered Institute of Stockbrokers Nigeria and the Chartered Institute for Securities and Investment United Kingdom."
  },
  {
    "id": "HOP3",
    "name": "SAMUEL NDUBUISI OSEAFIANA",
    "title": "Executive Director​",
    "image": "assets/leadership-images/sammy.jpg",
    "description": "Samuel Oseafiana is the Group Executive Director, Governance, Risk and Compliance. He has developed specific skills in business process, financial management and strategic sales dynamics in the banking industry. \n Samuel started his career with Zenith Bank Plc in 2009, rose through the ranks and necessary experiences to become the head of Enugu zonal cash management team. In 2019 he joined the Business Development team of Zenith bank plc. \n He joined AVVIC group in 2022 and was appointed the Managing Director of Avvic Connect Ltd. Samuel holds a degree in Accounting Education from the University of Benin, Benin City, a student member of Chartered institute of Bankers of Nigeria (CIBN) and a member of the Institute of Chartered Accountants of Nigeria (ICAN)."
  },
  {
    "id": "HOP4",
    "name": "ODERA OGBODO",
    "title": "Executive Director",
    "image": "assets/leadership-images/odera.jpeg",
    "description": "Odera Ogbodo is the Group Executive Director, Technology, Research and Development. \n He brings to the Board, extensive competencies in IT, data analysis, tech analysis, electronic business development and management. \n He worked as a Data and Tech Analyst at the University of Greenwich, London. He also worked as an Electronic Business Analyst with Zenith Bank Plc. He was Lead, Enterprise and Application Support for VFD Tech Limited. \n Odera Ogbodo holds a B.Sc, First Class Honours, in Information and Communication Technology from the prestigious University of Greenwich, London."
  }
]
